# RebarInstanceStirrupTieAttachment Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarInstanceStirrupTieAttachment Property
ParameterTypeId Class See Also
---
"Stirrup/Tie Attachment"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarInstanceStirrupTieAttachment { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarInstanceStirrupTieAttachment As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarInstanceStirrupTieAttachment {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace